tap "apenngrace/vulkan"
tap "equalsraf/neovim-qt"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "koekeishiya/formulae"
tap "kryptco/tap"
tap "railwaycat/emacsmacport"
tap "rogual/neovim-dot-app"
tap "schniz/tap"
tap "uptech/oss"
tap "wagoodman/dive"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Dynamic, general-purpose programming language
brew "clojure"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Passphrases to remember
brew "diceware"
# Load/unload environment variables based on $PWD
brew "direnv"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Native sequence editor for Git interactive rebase
brew "git-interactive-rebase-tool"
# Generic library support script
brew "libtool"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Make JSON greppable
brew "gron"
# Idempotent command-line utility for managing your /etc/hosts file
brew "hostess"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# Improved colored diff
brew "icdiff"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kafkacat"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Build tool for Clojure
brew "leiningen"
# Sophisticated file transfer program
brew "lftp"
# Count lines of code quickly
brew "loc"
# Swiss Army Knife for macOS
brew "m-cli"
# Mac App Store command-line interface
brew "mas"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@10"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Command-line YAML and XML processor that wraps jq
brew "python-yq"
# Run SQL directly on CSV or TSV files
brew "q"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup-init"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Text interface for Git repositories
brew "tig"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Show the current WiFi network password
brew "wifi-password"
# Fast CSV toolkit written in Rust
brew "xsv"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac", link: false
# Fast and simple Node.js version manager
brew "schniz/tap/fnm"
# command-line utility to find alternate file
brew "uptech/oss/alt"
# A tool for exploring each layer in a docker image
brew "wagoodman/dive/dive"
cask "1password"
cask "alacritty"
cask "alfred"
cask "android-studio"
cask "appcleaner"
cask "arq"
cask "bitwarden"
cask "brave-browser"
cask "brewservicesmenubar"
cask "dbeaver-community"
cask "docker"
cask "dropbox"
cask "emacs-mac-spacemacs-icon"
cask "evernote"
cask "ferdi"
cask "figma"
cask "firefox"
cask "flux"
cask "font-fira-code"
cask "font-firacode-nerd-font"
cask "font-juliamono"
cask "franz"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive-file-stream"
cask "gpg-suite"
cask "helium"
cask "imageoptim"
cask "iterm2"
cask "java8"
cask "kafka-tool"
cask "karabiner-elements"
cask "key-codes"
cask "keybase"
cask "kitty"
cask "krisp"
cask "mark-text"
cask "microsoft-teams"
cask "miro-formerly-realtimeboard"
cask "ngrok"
cask "notion"
cask "numi"
cask "onedrive"
cask "oni"
cask "oracle-jdk"
cask "osxfuse"
cask "pgadmin4"
cask "postman"
cask "qlstephen"
cask "raindropio"
cask "skitch"
cask "skype-for-business"
cask "slack"
cask "sonos"
cask "spotify"
cask "standard-notes"
cask "steam"
cask "syncthing"
cask "tableplus"
cask "tandem"
cask "textexpander"
cask "torbrowser"
cask "trailer"
cask "transmission"
cask "typinator"
cask "typora"
cask "veonim"
cask "vimr"
cask "viscosity"
cask "visual-studio-code"
cask "vmware-horizon-client"
cask "vulkan-sdk"
cask "vv"
cask "zoomus"
mas "Airmail", id: 918858936
mas "BetterSnapTool", id: 417375580
mas "DaisyDisk", id: 411643860
mas "Dice Pass", id: 997688302
mas "F5Access", id: 1243219105
mas "Fenêtre", id: 1286743037
mas "Folder Tidy", id: 486626129
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PiPifier", id: 1160374471
mas "Pomo Timer", id: 1447569061
mas "Shazam", id: 897118787
mas "Shush", id: 496437906
mas "Xcode", id: 497799835
