tap "caskroom/cask"
tap "caskroom/drivers"
tap "caskroom/versions"
tap "grammarly/tap"
tap "homebrew/binary"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/fuse"
tap "homebrew/services"
tap "homebrew/versions"
tap "keithbsmiley/formulae"
tap "kryptco/tap"
tap "telemachus/desc"
cask "osxfuse"
cask "xquartz"
brew "ack"
brew "aescrypt"
brew "amazon-ecs-cli"
brew "autoenv"
brew "automake"
brew "awscli"
brew "bash"
brew "bazaar"
brew "bindfs"
brew "bison"
brew "blackbox"
brew "brew-pip"
brew "cabal-install"
brew "cabextract"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "ctop"
brew "dbus"
brew "dhex"
brew "direnv"
brew "emacs"
brew "fasd"
brew "findutils"
brew "fish"
brew "fortune"
brew "git"
brew "git-cal"
brew "git-crypt"
brew "gnu-getopt"
brew "gnu-sed"
brew "gpp"
brew "grails"
brew "grc"
brew "grep"
brew "groovy"
brew "hardlink-osx"
brew "haskell-stack"
brew "html-xml-utils"
brew "htop"
brew "httpstat"
brew "hub"
brew "hubflow"
brew "hugo"
brew "icdiff"
brew "jid"
brew "jq"
brew "kibana@4.4"
brew "kompose"
brew "kubernetes-cli"
brew "languagetool"
brew "lastpass-cli"
brew "libgphoto2"
brew "libidn"
brew "libressl"
brew "librsvg"
brew "logstash"
brew "lynx"
brew "makedepend"
brew "mas"
brew "maven"
brew "mercurial"
brew "mitmproxy"
brew "moreutils"
brew "mutt"
brew "ncdu"
brew "nmap"
brew "node"
brew "orientdb"
brew "osquery"
brew "p7zip"
brew "peco"
brew "poppler"
brew "postgis"
brew "pup"
brew "pv"
brew "qt"
brew "rabbitmq"
brew "ranger"
brew "rename"
brew "rest-shell"
brew "resty"
brew "ripgrep"
brew "sane-backends"
brew "shared-mime-info"
brew "shellcheck"
brew "siege"
brew "sl"
brew "ssh-copy-id"
brew "sysdig"
brew "testdisk"
brew "the_silver_searcher"
brew "thefuck"
brew "thrift"
brew "tig"
brew "titan-server"
brew "tmux"
brew "todo-txt"
brew "transcrypt"
brew "tree"
brew "unixodbc"
brew "unrar"
brew "utf8proc"
brew "vim"
brew "watch"
brew "webkit2png"
brew "wifi-password"
brew "wine"
brew "wireshark"
brew "zsh"
brew "grammarly/tap/rocker"
brew "keithbsmiley/formulae/lunchy"
brew "keithbsmiley/formulae/zap"
brew "telemachus/desc/brew-desc"
cask "alfred"
cask "android-file-transfer"
cask "android-sdk"
cask "anvil"
cask "appcleaner"
cask "atom"
cask "boostnote"
cask "boxer"
cask "brave"
cask "coconutbattery"
cask "contexts"
cask "diskwave"
cask "dosbox"
cask "dropbox"
cask "exodus"
cask "fantastical"
cask "firefox"
cask "flash"
cask "flux"
cask "foldingtext"
cask "franz"
cask "github-desktop"
cask "gitify"
cask "gitscout"
cask "gitter"
cask "google-chrome"
cask "google-drive"
cask "gpgtools"
cask "gpgtools-beta"
cask "hyper"
cask "hyperterm"
cask "jaxx"
cask "karabiner"
cask "keybase"
cask "keyboard-maestro"
cask "kitematic"
cask "lacona"
cask "lastpass"
cask "macvim"
cask "mailspring"
cask "marp"
cask "mightytext"
cask "minikube"
cask "miro-video-converter"
cask "ngrok"
cask "noti"
cask "notion"
cask "nvalt"
cask "nylas-mail"
cask "nylas-n1"
cask "p4merge"
cask "plex-home-theater"
cask "postbox"
cask "qlstephen"
cask "radiant-player"
cask "rambox"
cask "resilio-sync"
cask "rocket"
cask "seil"
cask "skim"
cask "skitch"
cask "skype"
cask "softu2f"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "sql-tabs"
cask "steam"
cask "sublime-text"
cask "sublime-text3"
cask "tagspaces"
cask "the-unarchiver"
cask "thunderbird"
cask "tomtom-mysports-connect"
cask "torbrowser"
cask "trailer"
cask "transmission"
cask "typinator"
cask "unetbootin"
cask "upterm"
cask "vagrant"
cask "veracrypt"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "vysor"
cask "whatsapp"
cask "wireshark"
cask "caskroom/drivers/sonos"
cask "caskroom/versions/iterm2-beta"
cask "caskroom/versions/pgadmin3"
