tap "caskroom/cask"
# tap "caskroom/drivers"
# tap "caskroom/versions"
# tap "grammarly/tap"
# tap "homebrew/binary"
# tap "homebrew/boneyard"
tap "homebrew/bundle"
# tap "homebrew/command-not-found"
tap "homebrew/core"
# tap "homebrew/dupes"
tap "homebrew/fuse"
tap "homebrew/services"
# tap "homebrew/versions"
# tap "keithbsmiley/formulae"
tap "kryptco/tap"
# tap "telemachus/desc"
cask "osxfuse"
cask "xquartz"
# brew "ack"
# brew "aescrypt"
brew "amazon-ecs-cli"
# brew "autoenv"
brew "awscli"
brew "bash"
# brew "bazaar"
brew "bindfs"
brew "gnupg"
# brew "blackbox"
brew "brew-pip" # !!
# brew "cabextract"
brew "cloc"
brew "coreutils"
# brew "cowsay"
brew "ctop"
# brew "dbus"
brew "dhex"
# brew "direnv"
# brew "emacs"
# brew "erlang"
# brew "fasd"
brew "findutils"
# brew "fish"
# brew "fortune"
brew "perl"
brew "git"
brew "python3"
# brew "shared-mime-info"
brew "git-cal"
brew "git-crypt"
brew "gnu-getopt"
# brew "gnu-sed"
# brew "grails"
brew "grc"
brew "groovy"
brew "hardlink-osx"
# brew "haskell-stack"
# brew "html-xml-utils"
brew "htop-osx"
brew "httpstat"
brew "hub"
# brew "hubflow"
# brew "hugo"
brew "icdiff"
# brew "jid"
brew "jq"
# brew "kibana@4.4"
# brew "kompose"
brew "kubernetes-cli"
brew "lastpass-cli"
# brew "libgphoto2"
# brew "libidn"
# brew "libressl"
# brew "librsvg"
# brew "logstash"
# brew "lynx"
# brew "lzlib"
brew "mas"
# brew "maven"
# brew "mercurial"
brew "mitmproxy"
brew "moreutils"
# brew "mutt"
brew "ncdu"
brew "nmap"
brew "node"
# brew "orientdb"
# brew "osquery"
brew "p7zip"
brew "peco"
brew "poppler"
# brew "postgis"
brew "pup"
brew "pv"
# brew "qt"
# brew "rabbitmq"
# brew "ranger"
brew "rename"
# brew "rest-shell"
# brew "resty"
# brew "rexster"
brew "ripgrep"
brew "ruby"
brew "sane-backends"
brew "shellcheck"
brew "siege"
# brew "sl"
brew "ssh-copy-id"
# brew "sysdig"
# brew "testdisk"
# brew "the_silver_searcher"
# brew "thefuck"
# brew "thrift"
brew "tig"
# brew "titan-server"
brew "tmux"
# brew "todo-txt"
# brew "transcrypt"
brew "tree"
# brew "unixodbc"
brew "unrar"
# brew "utf8proc"
brew "vim"
brew "watch"
# brew "webkit2png"
brew "wifi-password"
# brew "wine"
brew "wireshark"
brew "zsh"
# brew "grammarly/tap/rocker"
brew "keithbsmiley/formulae/lunchy"
brew "keithbsmiley/formulae/zap"
# brew "telemachus/desc/brew-desc"
cask "alfred"
cask "android-file-transfer"
# cask "anvil"
cask "appcleaner"
# cask "atom"
# cask "boostnote"
cask "boxer"
# cask "coconutbattery"
cask "diskwave"
cask "dosbox"
cask "dropbox"
# cask "exodus"
cask "firefox"
# cask "flash"
# cask "flux"
cask "foldingtext"
# cask "franz"
# cask "github-desktop"
cask "gitify"
cask "gitscout"
cask "gitter"
cask "google-chrome"
cask "google-drive"
cask "gpgtools"
cask "gpgtools-beta"
cask "hyper"
cask "hyperterm"
cask "iterm2-beta"
cask "jaxx"
cask "karabiner"
cask "keybase"
cask "kitematic"
cask "lastpass"
cask "macvim"
cask "marp"
cask "mightytext"
cask "minikube"
cask "miro-video-converter"
cask "ngrok"
cask "noti"
cask "notion"
cask "nvalt"
cask "nylas-mail"
cask "nylas-n1"
cask "p4merge"
cask "pgadmin3"
cask "plex-home-theater"
cask "postbox"
cask "qlstephen"
cask "radiant-player"
cask "rambox"
cask "resilio-sync"
cask "rocket"
cask "seil"
cask "skim"
cask "skitch"
cask "skype"
cask "softu2f"
cask "sonos"
cask "sourcetree"
cask "spotify"
cask "sql-tabs"
cask "steam"
cask "sublime-text"
cask "sublime-text3"
cask "tagspaces"
cask "the-unarchiver"
cask "thunderbird"
cask "tomtom-mysports-connect"
cask "torbrowser"
cask "trailer"
cask "transmission"
cask "unetbootin"
cask "upterm"
cask "vagrant"
cask "veracrypt"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "vysor"
cask "wireshark"
mas "Airmail 2", id: 918858936
mas "BetterSnapTool", id: 417375580
mas "Canary Mail", id: 1236045954
mas "ClamXav", id: 430207028
mas "Flow", id: 469770826
mas "Folder Tidy", id: 486626129
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "iPhoto", id: 408981381
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Marko", id: 607997198
mas "Metanota Pro", id: 515250764
mas "Microsoft Remote Desktop", id: 715768417
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paint X Lite", id: 668502966
mas "Pasteasy", id: 906277880
mas "PiPifier", id: 1160374471
mas "Pocket", id: 568494494
mas "Shazam", id: 897118787
mas "Simplenote", id: 692867256
mas "Slack", id: 803453959
mas "Social Pro", id: 433364821
mas "Sunrise Calendar", id: 886106985
mas "TurboCollage", id: 433371445
mas "Tweetbot", id: 557168941
mas "Xcode", id: 497799835
