tap "agrinman/tap"
tap "apenngrace/vulkan"
tap "equalsraf/neovim-qt"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jason0x43/neovim-nightly"
tap "jesseduffield/lazydocker"
tap "koekeishiya/formulae"
tap "kryptco/tap"
tap "railwaycat/emacsmacport"
tap "rogual/neovim-dot-app"
tap "schniz/tap"
tap "thoughtbot/formulae"
tap "trinitronx/pcloud"
tap "uptech/oss"
tap "wagoodman/dive"
# Improved shell history for zsh and bash
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Dynamic, general-purpose programming language
brew "clojure"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Passphrases to remember
brew "diceware"
# Load/unload environment variables based on $PWD
brew "direnv"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr", link: false
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Build automation tool for the container era
brew "earthly"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Generic library support script
brew "libtool"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Idempotent command-line utility for managing your /etc/hosts file
brew "hostess"
# Improved top (interactive process viewer)
brew "htop"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# Improved colored diff
brew "icdiff"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kafkacat"
<<<<<<< Updated upstream
# Selection-based modal text editor
brew "kakoune"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
||||||| constructed merge base
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
=======
>>>>>>> Stashed changes
# Build tool for Clojure
brew "leiningen"
# Sophisticated file transfer program
brew "lftp"
# Count lines of code quickly
brew "loc"
# Swiss Army Knife for macOS
brew "m-cli"
# Mac App Store command-line interface
brew "mas"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# NCurses Disk Usage
brew "ncdu"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Development kit for the Java programming language
brew "openjdk@11"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Object-relational database system
brew "postgresql"
# Command-line YAML and XML processor that wraps jq
brew "python-yq"
# Run SQL directly on CSV or TSV files
brew "q"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup-init"
# Autoformat shell script source code
brew "shfmt"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to build, change, and version infrastructure
brew "terraform"
# Text interface for Git repositories
brew "tig"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Show the current WiFi network password
brew "wifi-password"
# Fast CSV toolkit written in Rust
brew "xsv"
# JavaScript package manager
brew "yarn"
<<<<<<< Updated upstream
# Shell extension to navigate your filesystem faster
brew "zoxide"
||||||| constructed merge base
=======
# Tracks most-used directories to make cd smarter
brew "z"
>>>>>>> Stashed changes
# UNIX shell (command interpreter)
brew "zsh"
# Expose your local web server to the internet with a public url: https://tunnelto.dev
brew "agrinman/tap/tunnelto"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac", link: false
# Identify complex code
brew "thoughtbot/formulae/complexity"
# Command-line utility to find alternate file
brew "uptech/oss/alt"
# A tool for exploring each layer in a docker image
brew "wagoodman/dive/dive"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# Multi-cloud backup application
cask "arq"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Menu item for starting and stopping homebrew services
cask "brewservicesmenubar"
# GUI app for Homebrew
cask "cakebrew"
# Keyboard-centric application and window switcher
cask "command-tab-plus"
# Free universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "emacs-mac-spacemacs-icon"
# App for note taking, organizing, task lists, and archiving
cask "evernote"
# Free messaging app for popular messengers
cask "ferdi"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Screen color temperature controller
cask "flux"
cask "font-fira-code"
# Monospaced typeface designed for programming in Julia
cask "font-juliamono"
# GIT client
cask "fork"
# Messaging app for WhatsApp, Facebook Messenger, Slack, Telegram and more
cask "franz"
# Notes manager
cask "fsnotes"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Client for the Google Drive storage service
cask "google-drive-file-stream"
# Tools to protect your emails and files
cask "gpg-suite"
cask "helium"
# Access the HEY email service
cask "hey"
# Tool to optimize images to a smaller size
cask "imageoptim"
# HTTP and GraphQL Client
cask "insomnia"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
<<<<<<< Updated upstream
cask "java8"
||||||| constructed merge base
# Optimise and personalise your Jabra headset
cask "jabra-direct"
cask "java8"
=======
# Optimise and personalise your Jabra headset
cask "jabra-direct"
>>>>>>> Stashed changes
cask "kafka-tool"
# Keyboard customizer
cask "karabiner-elements"
# Display key code, unicode value and modifier keys state for any key combination
cask "key-codes"
# End-to-end encryption software
cask "keybase"
# GPU-based terminal emulator
cask "kitty"
# Sound clear in online meetings
cask "krisp"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
cask "mark-text"
<<<<<<< Updated upstream
# Meet, chat, call, and collaborate in just one place
||||||| constructed merge base
=======
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
>>>>>>> Stashed changes
cask "microsoft-teams"
# Utility to move and zoom windows—on one display
cask "moom"
cask "neovim-nightly"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Cloud storage client
cask "onedrive"
<<<<<<< Updated upstream
cask "oni"
# JDK from Oracle
||||||| constructed merge base
cask "oni"
=======
>>>>>>> Stashed changes
cask "oracle-jdk"
# File system integration
cask "osxfuse"
# HTTP client that helps testing and describing APIs
cask "paw"
# Client for the pCloud virtual cloud storage service
cask "pcloud-drive"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Home media player
cask "plex"
# GUI client for PostgreSQL databases
cask "postico"
# Collaboration platform for API development
cask "postman"
# Modern and intuitive HTTP Debugging Proxy app
cask "proxyman"
# All-in-one bookmark manager
cask "raindropio"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Instant messaging application focusing on security
cask "signal"
# Screen capture tool with mark up and sharing features
cask "skitch"
# Microsofts instant messaging enterprise software
cask "skype-for-business"
# Team communication and collaboration software
cask "slack"
# Control your Sonos system
cask "sonos"
# Music streaming service
cask "spotify"
# Free, open-source, and completely encrypted notes app
cask "standard-notes"
# Video game digital distribution service
cask "steam"
# Real time file synchronization software
cask "syncthing"
# Native GUI tool for relational databases
cask "tableplus"
# Virtual office for remote teams
cask "tandem"
# Inserts pre-made snippets of text anywhere
cask "textexpander"
# Managing Pull Requests and Issues For GitHub & GitHub Enterprise
cask "trailer"
# Open-source BitTorrent client
cask "transmission"
# Tool to automate the insertion of frequently used text and graphics
cask "typinator"
# Configurable document editor that supports Markdown
cask "typora"
<<<<<<< Updated upstream
cask "veonim"
||||||| constructed merge base
# Modal IDE built on neovim
cask "veonim"
=======
>>>>>>> Stashed changes
# GUI for the Neovim text editor
cask "vimr"
# VPN client for secure internet access and private browsing
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# Virtual machine client
cask "vmware-horizon-client"
# Neovim client
cask "vv"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "BetterSnapTool", id: 417375580
mas "DaisyDisk", id: 411643860
mas "Dice Pass", id: 997688302
mas "Fenêtre", id: 1286743037
mas "Folder Tidy", id: 486626129
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Menu Bar Controller for Sonos", id: 1357379892
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PiPifier", id: 1160374471
mas "Pomo Timer", id: 1447569061
mas "Shazam", id: 897118787
<<<<<<< Updated upstream
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
||||||| constructed merge base
mas "Xcode", id: 497799835
=======
>>>>>>> Stashed changes
