tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "kryptco/tap"
tap "railwaycat/emacsmacport"
tap "wagoodman/dive"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bat"
brew "choose-gui"
brew "clojure"
brew "cmake"
brew "coreutils"
brew "csvkit"
brew "direnv"
brew "dtrx"
brew "exa"
brew "fd"
brew "findutils"
brew "fish"
brew "fzf"
brew "ghq"
brew "git"
brew "git-cal"
brew "git-crypt"
brew "graphviz"
brew "hostess"
brew "htop"
brew "httpie"
brew "httpstat"
brew "hub"
brew "icdiff"
brew "interactive-rebase-tool"
brew "kubectx"
brew "leiningen"
brew "lftp"
brew "libidn2"
brew "loc"
brew "m-cli"
brew "mas"
brew "mitmproxy"
brew "moreutils"
brew "ncdu"
brew "neovim"
brew "nvm"
brew "peco"
brew "pgcli"
brew "pv"
brew "python-yq"
brew "q"
brew "rename"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "tee-clc"
brew "terraform"
brew "tig"
brew "tree"
brew "vim"
brew "watch"
brew "wifi-password"
brew "xsv"
brew "yarn"
brew "zsh"
brew "heroku/brew/heroku"
brew "railwaycat/emacsmacport/emacs-mac"
brew "wagoodman/dive/dive"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "bitwarden"
cask "brave-browser"
cask "cyberduck"
cask "dbeaver-community"
cask "docker-edge"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "font-fira-code"
cask "franz"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "graphql-playground"
cask "helium"
cask "imageoptim"
cask "iterm2"
cask "java8"
cask "joplin"
cask "karabiner-elements"
cask "keepassxc"
cask "keybase"
cask "kitty"
cask "ngrok"
cask "numi"
cask "onedrive"
cask "osxfuse"
cask "pgadmin4"
cask "postman"
cask "qlstephen"
cask "rambox"
cask "skitch"
cask "softu2f"
cask "sonos"
cask "spotify"
cask "standard-notes"
cask "steam"
cask "textexpander"
cask "torbrowser"
cask "trailer"
cask "transmission"
cask "typinator"
cask "viscosity"
cask "visual-studio-code"
cask "yed"
mas "com.apple.dt.Xcode", id: 497799835
mas "com.apple.garageband10", id: 682658836
mas "com.apple.iMovieApp", id: 408981434
mas "com.apple.iWork.Keynote", id: 409183694
mas "com.apple.iWork.Numbers", id: 409203825
mas "com.apple.iWork.Pages", id: 409201541
mas "com.crowdcafe.windowmagnet", id: 441258766
mas "com.daisydiskapp.DaisyDisk", id: 411643860
mas "com.francescodilorenzo.Mailbro", id: 1053031090
mas "com.hegenberg.BetterSnapTool", id: 417375580
mas "com.lastpass.LastPass", id: 926036361
mas "com.leonspok.osx.Irvue", id: 1039633667
mas "com.microsoft.onenote.mac", id: 784801555
mas "com.shazam.mac.Shazam", id: 897118787
mas "com.tunabellysoftware.cleanmydesktop", id: 486626129
mas "com.yoannmoinet.fenetre", id: 1286743037
mas "de.APPenzeller.PiPifier", id: 1160374471
mas "it.bloop.airmail2", id: 918858936
mas "net.troz.DicePass", id: 997688302
