tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "lyraphase/pcloud"
tap "macos-fuse-t/cask"
tap "sachaos/todoist"
tap "tavianator/tap"
tap "withgraphite/tap"
tap "xcodesorg/made"
# Run your GitHub Actions locally
brew "act"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Text processing scripting language
brew "awk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Top-like interface for container metrics
brew "ctop"
# Power of curl, ease of use of httpie
brew "curlie"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Generic library support script
brew "libtool"
# Generate pixel-perfect macOS folder icons in the native style
brew "folderify"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Native sequence editor for Git interactive rebase
brew "git-interactive-rebase-tool"
# Rebase alternative for easy & efficient in-memory rebases and fixups
brew "git-revise"
# Trim your git remote tracking branches that are merged or gone
brew "git-trim"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Improved top (interactive process viewer)
brew "htop"
# Platform built on V8 to build network applications
brew "node"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Terminal file manager
brew "lf"
# Library that sends desktop notifications to a notification daemon
brew "libnotify"
# Library for USB device access
brew "libusb"
# Package manager for the Lua programming language
brew "luarocks"
# Swiss Army Knife for macOS
brew "m-cli"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# Send push notifications to your phone or desktop via PUT/POST
brew "ntfy"
# Smart, Fast and Extensible Build System
brew "nx"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# General purpose fuzzy finder TUI
brew "television"
# Tool to build, change, and version infrastructure
brew "terraform"
# Text interface for Git repositories
brew "tig"
# Official tldr client written in Rust
brew "tlrc"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Fast CSV toolkit written in Rust
brew "xsv"
# Bring your favorite shell wherever you go through the ssh
brew "xxh"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Todoist CLI client
brew "sachaos/todoist/todoist"
# Breadth-first version of find.
brew "tavianator/tap/bfs"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Stand alone ad blocker
cask "adguard"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Prevents your sleeping computer from connecting to Bluetooth accessories
cask "bluesnooze"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Security audit software
cask "drata-agent"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Screen colour temperature controller
cask "flux-app"
# Unofficial native application for Fastmail
cask "fmail2"
# Unofficial native application for Fastmail
cask "fmail3"
cask "font-cascadia-mono-nf"
cask "font-comic-mono"
cask "font-commit-mono"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-iosevka-curly-slab"
cask "font-iosevka-etoile"
cask "font-iosevka-term-slab-nerd-font"
cask "font-juliamono"
cask "font-monaspice-nerd-font"
# GIT client
cask "fork"
# LibFUSE implementation that doesn't use kernel extensions
cask "fuse-t"
# SSHFS implementation based on FUSE-T
cask "fuse-t-sshfs"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance-chamburr"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Optimise and personalise your Jabra headset
cask "jabra-direct"
# Keyboard customiser
cask "karabiner-elements"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Adaptive brightness for external displays
cask "lunar"
# File system integration
cask "macfuse"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Online collaborative whiteboard platform
cask "miro"
# Utility to move and zoom windows—on one display
cask "moom"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Android file transfer
cask "openmtp"
# WebKit based web browser
cask "orion"
# Client for the pCloud virtual cloud storage service
cask "pcloud-drive"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Home media player
cask "plex"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Collaboration platform for API development
cask "postman"
# Menu bar app that provides more control over Night Shift
cask "shifty"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Control your Sonos system
cask "sonos"
# Music streaming service
cask "spotify"
# Git client
cask "sublime-merge"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Connect to Windows
cask "windows-app"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "Aiko", id: 1672085276
mas "Airmail", id: 918858936
mas "Amphetamine", id: 937984704
mas "DaisyDisk", id: 411643860
mas "DiceGen", id: 980521593
mas "Folder Tidy", id: 486626129
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "iPreview", id: 1519213509
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Meeter", id: 1510445899
mas "Menu Bar Controller for Sonos", id: 1357379892
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDFCutter", id: 1166130532
mas "rcmd", id: 1596283165
mas "Shazam", id: 897118787
mas "Todoist", id: 585829637
vscode "aaron-bond.better-comments"
vscode "albert.tabout"
vscode "alefragnani.project-manager"
vscode "alexanderte.dainty-vscode"
vscode "alexesprit.vscode-unfancy-file-icons"
vscode "alexpasmantier.television"
vscode "angelomollame.conflict-squeezer"
vscode "arcanis.vscode-zipfs"
vscode "atelierbram.base2tone-vscode-themes"
vscode "bettercallshao.indent-sorter"
vscode "bmalehorn.vscode-fish"
vscode "bradlc.vscode-tailwindcss"
vscode "cdonohue.polychrome-vscode-themes"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cmstead.js-codeformer"
vscode "cmstead.jsrefactor"
vscode "danielyxie.vscode-kolmafia-ash"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "docmarty.open-tig"
vscode "donjayamanne.githistory"
vscode "dunstontc.viml"
vscode "editorconfig.editorconfig"
vscode "edonet.vscode-command-runner"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-git-history"
vscode "felixfbecker.postgresql-syntax"
vscode "foxundermoon.shell-format"
vscode "fractalbrew.backticks"
vscode "gebhard.git-fixup"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "huytd.github-light-monochrome"
vscode "hyzeta.vscode-theme-github-light"
vscode "irongeek.vscode-env"
vscode "j-brooke.fracturedjsonvsc"
vscode "jakearl.search-editor-apply-changes"
vscode "jellydn.fzf-picker"
vscode "keisukeyamashita.vscode-tig-language-support"
vscode "leizongmin.node-module-intellisense"
vscode "m4ns0ur.base64"
vscode "maattdd.gitless"
vscode "mariusschulz.yarn-lock-syntax"
vscode "matheusq94.tfs"
vscode "mhutchie.git-graph"
vscode "mikehhodgson.monochrome-dark"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "naela.comment-banners"
vscode "naumovs.color-highlight"
vscode "nextfaze.json-parse-stringify"
vscode "nrwl.angular-console"
vscode "orta.vscode-jest"
vscode "peterjpxie.find-in-current-file"
vscode "prisma.prisma"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "richie5um2.vscode-sort-json"
vscode "rknguyen.vscode-onion-monochrome-theme"
vscode "rpbritton.zenbones"
vscode "ryuta46.multi-command"
vscode "semanticdiff.semanticdiff"
vscode "sleistner.vscode-fileutils"
vscode "spmeesseman.vscode-taskexplorer"
vscode "sryze.uridecode"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-british-english"
vscode "streetsidesoftware.code-spell-checker-dutch"
vscode "streetsidesoftware.code-spell-checker-scientific-terms"
vscode "subframe7536.custom-ui-style"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tylerharris.terraform-link-docs"
vscode "usernamehw.errorlens"
vscode "wangweixuan.yithemes"
vscode "weecraft.brook-code-theme"
vscode "yoavbls.pretty-ts-errors"
vscode "yummygum.city-lights-icon-vsc"
vscode "yzhang.markdown-all-in-one"
