tap "apenngrace/vulkan"
tap "aws/tap"
tap "clojure/tools"
tap "dart-lang/dart"
tap "equalsraf/neovim-qt"
tap "eth-p/software"
tap "grishka/grishka"
tap "helix-editor/helix"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "kolmafia/kolmafia"
tap "kryptco/tap"
tap "railwaycat/emacsmacport"
tap "rogual/neovim-dot-app"
tap "schniz/tap"
tap "tavianator/tap"
tap "trinitronx/pcloud"
tap "uptech/oss"
tap "wagoodman/dive"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Text processing scripting language
brew "awk"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# OpenType text shaping engine
brew "harfbuzz"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@75"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# New way to see and navigate directory trees
brew "broot"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Power of curl, ease of use of httpie
brew "curlie"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Command-line tool for DigitalOcean
brew "doctl"
# Command-line DNS client
brew "dog"
# Friendly and expressive shell
brew "elvish"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Generic library support script
brew "libtool"
# Generate pixel-perfect macOS folder icons in the native style
brew "folderify"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Incremental merge for git
brew "git-imerge"
# Rebase alternative for easy & efficient in-memory rebases and fixups
brew "git-revise"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Platform built on V8 to build network applications
brew "node"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Selection-based modal text editor
brew "kakoune"
# Network authentication protocol
brew "krb5"
# Terminal file manager
brew "lf"
# Library that sends desktop notifications to a notification daemon
brew "libnotify"
# Postgres C API library
brew "libpq"
# Library for USB device access
brew "libusb"
# Count lines of code quickly
brew "loc"
# Package manager for the Lua programming language
brew "luarocks"
# Swiss Army Knife for macOS
brew "m-cli"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# Modern shell for the GitHub era
brew "nushell"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Fast, disk space efficient package manager
brew "pnpm"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Command-line YAML and XML processor that wraps jq
brew "python-yq"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Lightweight BitTorrent client
brew "transmission-cli"
# CLI tool that moves files or folder to the trash
brew "trash"
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Fast CSV toolkit written in Rust
brew "xsv"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Breadth-first version of find.
brew "tavianator/tap/bfs"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Desktop app for GPT-4 / GPT-3.5 (OpenAI API)
cask "chatbox"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Write, edit, and chat about your code with AI
cask "cursor"
# Collect, organise, edit and annotate documents
cask "devonthink"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Organise files, archive e-mails, save Web pages and notes, search everything
cask "eaglefiler"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Privacy-focused Firefox-based browser
cask "floorp"
# Screen colour temperature controller
cask "flux"
# Unofficial native application for Fastmail
cask "fmail2"
cask "font-comic-mono"
cask "font-commit-mono"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-juliamono"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Git client focusing on productivity
cask "gitkraken"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance-chamburr"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Grammarly for desktop
cask "grammarly-desktop"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Optimise and personalise your Jabra headset
cask "jabra-direct"
# Dimness and night shift menu bar app
cask "joshjon-nocturnal"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Keyboard customiser
cask "karabiner-elements"
# Display key code, unicode value and modifier keys state for any key combination
cask "key-codes"
# GPU-based terminal emulator
cask "kitty"
# Noise cancelling application
cask "krisp"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Discover, download, and run local LLMs
cask "lm-studio"
# Support for Logitech G gear
cask "logitech-g-hub"
# Adaptive brightness for external displays
cask "lunar"
# File system integration
cask "macfuse"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Online collaborative whiteboard platform
cask "miro"
# Utility to move and zoom windows—on one display
cask "moom"
# Unofficial Google Nearby Share app
cask "neardrop"
# Dual-pane file manager
cask "nimble-commander"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Android file transfer
cask "openmtp"
# Web browser
cask "opera"
# WebKit based web browser
cask "orion"
# Cloud-based, multi-factor authentication
cask "pingid"
cask "plantronics-hub"
# Home media player
cask "plex"
# GUI client for PostgreSQL databases
cask "postico"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Pomodoro time tracker
cask "roundpie"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Control your Sonos system
cask "sonos"
# Music streaming service
cask "spotify"
# Git client
cask "sublime-merge"
# Virtual office for remote teams
cask "tandem"
# Messaging app with a focus on speed and security
cask "telegram"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# To-do & task list manager
cask "ticktick"
# Git client focusing on power and productivity
cask "tower"
# Open-source BitTorrent client
cask "transmission"
# Tool to automate the insertion of frequently used text and graphics
cask "typinator"
# GUI which uses ADB to debloat non-rooted Android devices
cask "universal-android-debloater"
# OpenVPN client with AppleScript support
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Connect to Windows
cask "windows-app"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Create diagrams manually, or import external data for analysis
cask "yed"
# Document manager
cask "yep"
# Share, organise and collaborate on designs
cask "zeplin"
# Video communication and virtual meeting platform
cask "zoom"
mas "Agenda", id: 1287445660
mas "Aiko", id: 1672085276
mas "Airmail", id: 918858936
mas "Commander One", id: 1035236694
mas "DaisyDisk", id: 411643860
mas "DiceGen", id: 980521593
mas "Folder Tidy", id: 486626129
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "iPreview", id: 1519213509
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Meeter", id: 1510445899
mas "Menu Bar Controller for Sonos", id: 1357379892
mas "NotePlan", id: 1505432629
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDFCutter", id: 1166130532
mas "rcmd", id: 1596283165
mas "Shazam", id: 897118787
mas "Todoist", id: 585829637
mas "Trello", id: 1278508951
vscode "aaron-bond.better-comments"
vscode "albert.tabout"
vscode "angelomollame.conflict-squeezer"
vscode "artlaman.chalice-icon-theme"
vscode "atelierbram.base2tone-vscode-themes"
vscode "atlassian.atlascode"
vscode "bradlc.vscode-tailwindcss"
vscode "cdonohue.polychrome-vscode-themes"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "danielyxie.vscode-kolmafia-ash"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-quick-select"
vscode "dunstontc.viml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "foxundermoon.shell-format"
vscode "fractalbrew.backticks"
vscode "gamunu.vscode-yarn"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "huytd.github-light-monochrome"
vscode "irongeek.vscode-env"
vscode "jacano.vscode-pnpm"
vscode "jakearl.search-editor-apply-changes"
vscode "johv.parchment-light"
vscode "m4ns0ur.base64"
vscode "mariusschulz.yarn-lock-syntax"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "naumovs.color-highlight"
vscode "nextfaze.json-parse-stringify"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "sleistner.vscode-fileutils"
vscode "solidjs-community.solid-snippets"
vscode "sryze.uridecode"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-dutch"
vscode "styled-components.vscode-styled-components"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-lombok"
vscode "yzhang.markdown-all-in-one"
vscode "zawys.vscode-as-git-mergetool"
