oh-my-fish/plugin-expand
oh-my-fish/plugin-argu
barnybug/docker-fish-completion
brgmnn/fish-docker-compose
jethrokuan/fzf
matchai/spacefish
oh-my-fish/plugin-technicolor
evanlucas/fish-kubectl-completions
oh-my-fish/plugin-bang-bang
oh-my-fish/plugin-functional
oh-my-fish/plugin-aws
edc/bass
FabioAntunes/fish-nvm
jomik/fish-gruvbox
jethrokuan/z
