tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "lyraphase/pcloud"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Text processing scripting language
brew "awk"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Power of curl, ease of use of httpie
brew "curlie"
# Command-line DNS client
brew "dog"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Generic library support script
brew "libtool"
# Generate pixel-perfect macOS folder icons in the native style
brew "folderify"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Rebase alternative for easy & efficient in-memory rebases and fixups
brew "git-revise"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Improved top (interactive process viewer)
brew "htop"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Terminal file manager
brew "lf"
# Library that sends desktop notifications to a notification daemon
brew "libnotify"
# Library for USB device access
brew "libusb"
# Package manager for the Lua programming language
brew "luarocks"
# Swiss Army Knife for macOS
brew "m-cli"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Fast CSV toolkit written in Rust
brew "xsv"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Breadth-first version of find.
brew "tavianator/tap/bfs"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Android SDK component
cask "android-platform-tools"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Screen colour temperature controller
cask "flux"
# Unofficial native application for Fastmail
cask "fmail2"
cask "font-comic-mono"
cask "font-commit-mono"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-iosevka-curly-slab"
cask "font-iosevka-etoile"
cask "font-iosevka-term-slab-nerd-font"
cask "font-juliamono"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance-chamburr"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Optimise and personalise your Jabra headset
cask "jabra-direct"
# Keyboard customiser
cask "karabiner-elements"
# Keyboard shortcut utility
cask "ledger-live"
# Adaptive brightness for external displays
cask "lunar"
# File system integration
cask "macfuse"
# Provides updates to various Microsoft products
cask "microsoft-teams"
# Online collaborative whiteboard platform
cask "miro"
# Utility to move and zoom windows—on one display
cask "moom"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Android file transfer
cask "openmtp"
# WebKit based web browser
cask "orion"
# Home media player
cask "plex"
# Collaboration platform for API development
cask "postman"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Control your Sonos system
cask "sonos"
# Music streaming service
cask "spotify"
# Git client
cask "sublime-merge"
# Mesh VPN based on WireGuard
cask "tailscale"
# Messaging app with a focus on speed and security
cask "telegram"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Connect to Windows
cask "windows-app"
# Video communication and virtual meeting platform
cask "zoom"
mas "Agenda", id: 1287445660
mas "Aiko", id: 1672085276
mas "Airmail", id: 918858936
mas "DaisyDisk", id: 411643860
mas "DiceGen", id: 980521593
mas "Folder Tidy", id: 486626129
mas "iMovie", id: 408981434
mas "iPreview", id: 1519213509
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Meeter", id: 1510445899
mas "Menu Bar Controller for Sonos", id: 1357379892
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDFCutter", id: 1166130532
mas "rcmd", id: 1596283165
mas "Shazam", id: 897118787
mas "Todoist", id: 585829637
vscode "aaron-bond.better-comments"
vscode "albert.tabout"
vscode "alefragnani.project-manager"
vscode "angelomollame.conflict-squeezer"
vscode "atelierbram.base2tone-vscode-themes"
vscode "bradlc.vscode-tailwindcss"
vscode "cdonohue.polychrome-vscode-themes"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "danielyxie.vscode-kolmafia-ash"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dunstontc.viml"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "fractalbrew.backticks"
vscode "gebhard.git-fixup"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "huytd.github-light-monochrome"
vscode "irongeek.vscode-env"
vscode "j-brooke.fracturedjsonvsc"
vscode "jakearl.search-editor-apply-changes"
vscode "jasonlhy.hungry-delete"
vscode "m4ns0ur.base64"
vscode "mariusschulz.yarn-lock-syntax"
vscode "mhutchie.git-graph"
vscode "mikehhodgson.monochrome-dark"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "naumovs.color-highlight"
vscode "nextfaze.json-parse-stringify"
vscode "peterjpxie.find-in-current-file"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rknguyen.vscode-onion-monochrome-theme"
vscode "rpbritton.zenbones"
vscode "semanticdiff.semanticdiff"
vscode "sleistner.vscode-fileutils"
vscode "spmeesseman.vscode-taskexplorer"
vscode "sryze.uridecode"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-dutch"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "yoavbls.pretty-ts-errors"
vscode "yummygum.city-lights-icon-vsc"
vscode "yzhang.markdown-all-in-one"
